### From Pandas to SQL - **insert**

*by @italomarcelogit*

In [26]:
import sqlite3
import pandas as pd

df = pd.DataFrame(
    [
        [1, 'Ana', 30, 1],
        [2, 'Maria', 55, -1],
        [3, 'Barbara', 27, 1],
    ],
    columns=['id_pessoa', 'nome', 'idade', 'situacao'])
display(df)
conn = sqlite3.connect('dados/db1.db')
c = conn.cursor()
df.to_sql('pessoas', conn, index=False, if_exists='replace')
c.close()

   id_pessoa     nome  idade  situacao
0          1      Ana     30         1
1          2    Maria     55        -1
2          3  Barbara     27         1

### From Pandas to SQL - **select**

In [27]:
# connect and view all rows
conn = sqlite3.connect('dados/db1.db')
c = conn.cursor()
c.execute('select * from pessoas')
df = pd.DataFrame(
    c.fetchall(),
    columns=['id_pessoa', 'nome', 'idade', 'situacao'])
df

   id_pessoa     nome  idade  situacao
0          1      Ana     30         1
1          2    Maria     55        -1
2          3  Barbara     27         1